InformationRegisters/СопоставлениеДолжностейЭТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеДолжностейЭТД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодДолжностиЭТД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеЭТД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДолжностьОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДолжностьЭТД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДолжностьПоШтатномуРасписаниюЭТД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияЭТД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СопоставлениеПричинРасторженияЭТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеПричинРасторженияЭТД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодПричиныРасторженияЭТД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОснованиеУвольнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованияУвольненияЭТД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияЭТД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СопоставлениеПрофилейНавыковЭТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеПрофилейНавыковЭТД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрофильНавыков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиНавыковЭТД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВладелецПрофиля</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецПрофиляЭТД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияЭТД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГоловнойСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>22</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОрганизацияПоОкончании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПодразделениеПоОкончании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжностьПоШтатномуРасписаниюПоОкончании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжностьПоОкончании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидСобытияПоОкончании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидЗанятостиПоОкончании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидДоговораПоОкончании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикиРаботыПоВидамВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыПоВидамВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначениеНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначениеНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СменыРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяВЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВЦеломЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловияТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПереходящаяЧастьПредыдущейСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПереходящаяЧастьТекущейСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЗанятости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЭТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыЭТД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОтвета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЭТДСерверПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает организацию по умолчанию
// 
// Возвращаемое значение:
//  СправочникСсылка.Организации - Организация по умолчанию
//
Функция ОрганизацияПоУмолчанию() Экспорт
	
	Результат = Неопределено;
	
	ОрганизацияПоУмолчанию = Справочники.Организации.ПустаяСсылка();
	СтруктураЗначений = Новый Структура("Организация");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(СтруктураЗначений);
	СтруктураЗначений.Свойство("Организация", ОрганизацияПоУмолчанию);
	Результат = СтруктураЗначений.Организация;
	
	Возврат Результат;
	
КонецФункции

// Возвращает текст запроса для получения основных договоров
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Процедура СформироватьЗапросОсновныеДоговоры(Запрос) Экспорт
	
	СформироватьЗапросОсновныеДоговорыЗУП(Запрос);
	
КонецПроцедуры

// Возвращает текст запроса для получения дополнительных соглашений
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Процедура СформироватьЗапросДопСоглашения(Запрос) Экспорт
	
	СформироватьЗапросДопСоглашенияЗУП(Запрос);
	
КонецПроцедуры

// Возвращает текст запроса для получения договоров ранее уволенных сотрудников
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Процедура СформироватьЗапросДоговорыУволенных(Запрос) Экспорт
	
	СформироватьЗапросДоговорыУволенныхЗУП(Запрос);
	
КонецПроцедуры

// Возвращает текст запроса для сопоставления должностей
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Процедура СформироватьЗапросСопоставлениеДолжностей(Запрос) Экспорт
	
	СформироватьЗапросСопоставлениеДолжностейЗУП(Запрос);
	
КонецПроцедуры

// Возвращает текст запроса для получения расторгнутых договоров работающих сотрудников
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Процедура СформироватьЗапросВосстановленныеДоговоры(Запрос) Экспорт
	
	СформироватьЗапросВосстановленныеДоговорыЗУП(Запрос);
	
КонецПроцедуры

// Возвращает БИН организации
//
// Параметры:
//  Организация	- СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  Строка - БИН
//
Функция БИНОрганизации(Организация) Экспорт
	
	Результат = "";
	
	Результат = БИНОрганизацииЗУП(Организация);
	
	Возврат Результат;
	
КонецФункции

// Возвращает ИИН работника
//
// Параметры:
//  ФизическоеЛицо	- СправочникСсылка.ФизическиеЛица - физическое лицо
// 
// Возвращаемое значение:
//  Строка - ИИН
//
Функция ИИНРаботника(ФизическоеЛицо) Экспорт
	
	Результат = "";
	
	Результат = ИИНРаботникаЗУП(ФизическоеЛицо);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеСотрудника(Период, Сотрудник) Экспорт
	
	ДанныеСотрудника = Новый Структура;
	
	ДанныеСотрудника.Вставить("ДолжностьПоШтатномуРасписанию");
	ДанныеСотрудника.Вставить("Должность");
	ДанныеСотрудника.Вставить("КодДолжности");
	ДанныеСотрудника.Вставить("НаименованиеДолжности");
	ДанныеСотрудника.Вставить("ПоСовместительству");
	ДанныеСотрудника.Вставить("ДатаНачала");
	ДанныеСотрудника.Вставить("ДатаОкончания");
	ДанныеСотрудника.Вставить("НомерДоговора");
	ДанныеСотрудника.Вставить("РежимРабочегоВремени");
	ДанныеСотрудника.Вставить("ДоляНеполногоРабочегоВремени");
	ДанныеСотрудника.Вставить("ИИНРаботника");
	
	ПолучитьДанныеСотрудникаЗУП(ДанныеСотрудника, Период, Сотрудник);
	
	Возврат ДанныеСотрудника;
	
КонецФункции

Функция ПолучитьПерезаполняемыеДанныеСотрудника() Экспорт
	
	ДанныеСотрудника = Новый Структура;
	
	ДанныеСотрудника.Вставить("КодДолжности");
	ДанныеСотрудника.Вставить("НаименованиеДолжности");
	
	Возврат ДанныеСотрудника;
	
КонецФункции

Функция ПолучитьТекущегоПользователя() Экспорт
	
	Возврат Пользователи.ТекущийПользователь();
	
КонецФункции

Процедура ПриСозданииНаСервереЭТД(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ТекущаяОрганизация", "Объект.Организация");
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.Сотрудник.СвязиПараметровВыбора = НовыеСвязи;
	
	Если ИспользоватьШтатноеРасписание() Тогда
		Элементы.Должность.Видимость = Ложь;
	Иначе
		Элементы.ДолжностьПоШтатномуРасписанию.Видимость = Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элементы, "ФормаОбщаяКомандаПрисоединенныеФайлыБЗК") Тогда
		ПрисоединенныеФайлыБЗК = Элементы.ФормаОбщаяКомандаПрисоединенныеФайлыБЗК;
		ПрисоединенныеФайлыБЗК.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(Форма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

Процедура ПриСозданииНаСервереФормыСпискаЭТД(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(Форма, "Список");
	
	Элементы = Форма.Элементы;
	
	ИспользоватьШтатноеРасписание = ЭТДСервер.ИспользоватьШтатноеРасписание();
	Элементы.ДолжностьПоШтатномуРасписанию.Видимость = ИспользоватьШтатноеРасписание;
	Элементы.Должность.Видимость = НЕ ИспользоватьШтатноеРасписание;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элементы, "ФормаОбщаяКомандаПрисоединенныеФайлыБЗК") Тогда
		ПрисоединенныеФайлыБЗК = Элементы.ФормаОбщаяКомандаПрисоединенныеФайлыБЗК;
		ПрисоединенныеФайлыБЗК.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(Форма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

Процедура ПриСозданииНаСервереФормыСпискаРегистраСведений(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;
	
	ИспользоватьШтатноеРасписание = ЭТДСервер.ИспользоватьШтатноеРасписание();
	Элементы.ДолжностьОрганизации.Видимость = НЕ ИспользоватьШтатноеРасписание;
	Элементы.ДолжностьПоШтатномуРасписанию.Видимость = ИспользоватьШтатноеРасписание;
	
КонецПроцедуры

Процедура ПриСозданииНаСервереРабочееМестоЭТД(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

Процедура ПриСозданииНаСервереСопоставлениеДолжностей(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

Процедура ПриСозданииНаСервереСопоставлениеДолжностейЭТД(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

Процедура ПриСозданииНаСервереСопоставлениеПричинРасторженияЭТД(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

Процедура ПриСозданииНаСервереСопоставлениеПрофилейНавыковЭТД(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

Функция ИспользоватьШтатноеРасписание() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание");
	
КонецФункции

Функция ПолучитьДолжностьОрганизации(ДолжностьПоШтатномуРасписанию) Экспорт
	
	Должность = Неопределено;
	
	Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДолжностьПоШтатномуРасписанию, "Должность");
	
	Возврат Должность;
	
КонецФункции

Функция ПолучитьМассивВыбораВладельцыПрофиля() Экспорт
	
	СписокТипов = Новый СписокЗначений;
	
	Если ЭТДСервер.ИспользоватьШтатноеРасписание() Тогда
		
		СписокТипов.Добавить(Тип("СправочникСсылка.Сотрудники")); 
		СписокТипов.Добавить(Тип("СправочникСсылка.ШтатноеРасписание")); 
		
	Иначе
		
		СписокТипов.Добавить(Тип("СправочникСсылка.Должности"));
		СписокТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
		
	КонецЕсли;
	
	Возврат СписокТипов;
	
КонецФункции

Функция ФоновоеЗаданиеЗапущено(Знач ИмяПроцедуры) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЗаданиеАктивно", Ложь);
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода, Состояние", ИмяПроцедуры, СостояниеФоновогоЗадания.Активно));
		
	Если МассивФоновыхЗаданий.Количество() > 0 Тогда
		СтруктураВозврата.Вставить("ЗаданиеАктивно", Истина);
	КонецЕсли;		
	
	Возврат СтруктураВозврата;

КонецФункции

Функция ПараметрыВыполненияВФоне(Знач ИдентификаторФормы = Неопределено) Экспорт
	
	Возврат ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	
КонецФункции

Функция ВыполнитьВФоне(Знач ИмяЭкспортнойПроцедуры, Знач ПараметрыПроцедуры, Знач ПараметрыВыполнения) Экспорт
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(ИмяЭкспортнойПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);

	Возврат Результат;
	
КонецФункции

Функция ПолучитьСотрудникаПоИИН(ИИН, Организация, ДатаЗаключения) Экспорт
	
	Сотрудник = Неопределено;
	
	Сотрудник = ПолучитьСотрудникаПоИИНЗУП(ИИН, Организация, ДатаЗаключения);
	
	Возврат Сотрудник;
	
КонецФункции

Функция ПолучитьИИНПоСотруднику(Сотрудник) Экспорт
	
	ИИН = "";
	
	ИИН = ПолучитьИИНПоСотрудникуЗУП(Сотрудник);
	
	Возврат ИИН;
	
КонецФункции

Процедура СоздатьЗаписьЖурналаРегистрации(
	ИмяСобытия, 
	УровеньСтрокой = "", 
	ОбъектМетаданных = Неопределено, 
	Данные = Неопределено, 
	Комментарий = "") Экспорт
	
	Если УровеньСтрокой = "Информация" Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	ИначеЕсли УровеньСтрокой = "Ошибка" Тогда
		Уровень = УровеньЖурналаРегистрации.Ошибка;
	ИначеЕсли УровеньСтрокой = "Предупреждение" Тогда
		Уровень = УровеньЖурналаРегистрации.Предупреждение;
	ИначеЕсли УровеньСтрокой = "Примечание" Тогда
		Уровень = УровеньЖурналаРегистрации.Примечание;
	Иначе
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий);
	
КонецПроцедуры

Функция ПолучитьДанныеДляАвтозаполненияЭТД(Организация, Период) Экспорт
	
	СтруктураДанныхДляАвтозаполнения = Новый Структура("Организация, КодРегиона, КодРегионаРабочегоМеста, МестоРаботы, ТипРаботодателя");
	СтруктураДанныхДляАвтозаполнения.Организация = Организация;
	
	ПолучитьДанныеДляАвтозаполненияЗУП(Организация, Период, СтруктураДанныхДляАвтозаполнения);
	
	Возврат СтруктураДанныхДляАвтозаполнения;
	
КонецФункции

Процедура ЗаполнитьНаборыЗначенийДоступа(ДокументОбъект, Таблица) Экспорт
	
	ЗаполнитьНаборыЗначенийДоступаЗУП(ДокументОбъект, Таблица);
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СопоставлениеДолжностейЭТД",			"Период",	"КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СопоставлениеПричинРасторженияЭТД",	"Период",	"КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СопоставлениеПрофилейНавыковЭТД",		"Период",	"КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЭТД",										"Дата",		"КадровыйУчет", "Организация");
	
КонецПроцедуры

Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|РегистрСведений.СопоставлениеДолжностейЭТД.Чтение.Организации
	|РегистрСведений.СопоставлениеДолжностейЭТД.Изменение.Организации
	|РегистрСведений.СопоставлениеПричинРасторженияЭТД.Чтение.Организации
	|РегистрСведений.СопоставлениеПричинРасторженияЭТД.Изменение.Организации
	|РегистрСведений.СопоставлениеПрофилейНавыковЭТД.Чтение.Организации
	|РегистрСведений.СопоставлениеПрофилейНавыковЭТД.Изменение.Организации
	|РегистрСведений.СопоставлениеПрофилейНавыковЭТД.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СопоставлениеПрофилейНавыковЭТД.Изменение.ГруппыФизическихЛиц
	|Документ.ЭТД.Чтение.Организации
	|Документ.ЭТД.Чтение.ГруппыФизическихЛиц";
	
КонецПроцедуры

Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.СопоставлениеДолжностейЭТД, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СопоставлениеПричинРасторженияЭТД, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СопоставлениеПрофилейНавыковЭТД, Истина);
	Списки.Вставить(Метаданные.Документы.ЭТД, Истина);
	
КонецПроцедуры

Процедура ПриЗаполненииОграниченияДоступаРегистраСведений(Ограничение, НаименованиеОбъекта) Экспорт
	
	ТекстОграничения = "";
	
	Если НаименованиеОбъекта = "СопоставлениеДолжностейЭТД" Тогда
		ТекстОграничения =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)";
	ИначеЕсли НаименованиеОбъекта = "СопоставлениеПричинРасторженияЭТД" Тогда
		ТекстОграничения =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	ИначеЕсли НаименованиеОбъекта = "СопоставлениеПрофилейНавыковЭТД" Тогда
		ТекстОграничения =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И (ТИПЗНАЧЕНИЯ(ВладелецПрофиля) <> ТИП(Справочник.Сотрудники) ИЛИ ЗначениеРазрешено(ВладелецПрофиля))";
	КонецЕсли;
	
	Ограничение.Текст = ТекстОграничения;
	
КонецПроцедуры

Процедура ПриЗаполненииОграниченияДоступаЭТД(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Сотрудник)";
	
КонецПроцедуры

Процедура ПриЧтенииНаСервереРегистраСведений(Форма, ТекущийОбъект) Экспорт
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(Форма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервереРегистраСведений(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

Процедура ПриЧтенииНаСервереЭТД(Форма, ТекущийОбъект) Экспорт
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(Форма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервереЭТД(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

Функция ИдентификаторЭТД(Документ) Экспорт
	
	Результат = "";
	
	Результат = ИдентификаторЭТДЗУП(Документ);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьУсловияТрудаПоУмолчанию(ПараметрыПодбора = Неопределено) Экспорт
	
	Возврат "0";
	
КонецФункции

Функция СотрудникПодходитДляПрофессиональнойВыплаты(Сотрудник, ПериодДанных) Экспорт
	
	Возврат СотрудникПодходитДляПрофессиональнойВыплатыЗУП(Сотрудник, ПериодДанных);
	
КонецФункции

Функция ПолучитьПризнакГражданстваРК(Сотрудник, ПериодДанных) Экспорт
	
	Возврат ПолучитьПризнакГражданстваРКЗУП(Сотрудник, ПериодДанных);
	
КонецФункции

Процедура ПрисоединенныеФайлыПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
	
КонецПроцедуры

Функция ПолучитьПараметрыСотрудникаДляСоциальногоОтпуска(Сотрудник, ДатаПолученияДанных) Экспорт
	
	Возврат ПолучитьПараметрыСотрудникаДляСоциальногоОтпускаЗУП(Сотрудник, ДатаПолученияДанных);
	
КонецФункции

Функция ПолучитьКоличествоВыходныхДнейЗаПериод(Сотрудник, НачалоПериода, КонецПериода) Экспорт
	
	Возврат ПолучитьКоличествоВыходныхДнейЗаПериодЗУП(Сотрудник, НачалоПериода, КонецПериода);
	
КонецФункции

// Возвращает роль, для которой доступно изменение настроек обмена ЭТД
Функция ДоступнаРольИзмененияНастроекЭТД() Экспорт
	Возврат РольДоступна("ПолныеПрава")
			ИЛИ РольДоступна("ДобавлениеИзменениеНастроекЭТД");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьДанныеСотрудникаЗУП(ДанныеСотрудника, Знач Период, Сотрудник)
	
	ДанныеУчета = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудник, "Организация, ВидЗанятости, ИНН, ВидСобытия, ДолжностьПоШтатномуРасписанию, Должность, ДатаПриема, ДоляНеполногоРабочегоВремени, ТрудовойДоговорНомер, ТрудовойДоговорДата, СрочныйДоговор, СезонныйДоговор, ДатаОкончания", Период);
	
	Если ДанныеУчета.Количество() > 0 Тогда
		
		ДанныеУчетаСотрудника = ДанныеУчета[0];
		
		Если Период < ДанныеУчетаСотрудника.ДатаПриема Тогда // дата начала трудового договора указана неверно
			Период = ДанныеУчетаСотрудника.ДатаПриема;
			ДанныеУчета = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудник, "Организация, ВидЗанятости, ИНН, ВидСобытия, ДолжностьПоШтатномуРасписанию, Должность, ДатаПриема, ДоляНеполногоРабочегоВремени, ТрудовойДоговорНомер, ТрудовойДоговорДата, СрочныйДоговор, СезонныйДоговор, ДатаОкончания", Период);
			ДанныеУчетаСотрудника = ДанныеУчета[0];
		КонецЕсли;
		
		ДанныеДолжностиЭТД = ЭТДСервер.ПолучитьИнформациюОКодеДолжности(Период, ДанныеУчетаСотрудника.Должность, ДанныеУчетаСотрудника.ДолжностьПоШтатномуРасписанию, ДанныеУчетаСотрудника.Организация);
		
		ДанныеПрофильНавыков = ЭТДСервер.ПолучитьПрофильНавыков(Период, ДанныеУчетаСотрудника.ДолжностьПоШтатномуРасписанию, Сотрудник, ДанныеУчетаСотрудника.Организация);
		
		ДанныеСотрудника.Вставить("РежимРабочегоВремени", "1");
		
		ДанныеСотрудника.Вставить("ДоляНеполногоРабочегоВремени", "1");
		
		ДанныеСотрудника.Вставить("СрокДействия", "1");
		
		Если ЗначениеЗаполнено(ДанныеУчетаСотрудника.ДолжностьПоШтатномуРасписанию) Тогда
			ДанныеСотрудника.Вставить("ДолжностьПоШтатномуРасписанию", ДанныеУчетаСотрудника.ДолжностьПоШтатномуРасписанию);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеУчетаСотрудника.Должность) Тогда
			ДанныеСотрудника.Вставить("Должность", ДанныеУчетаСотрудника.Должность);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеДолжностиЭТД.КодДолжности) Тогда
			ДанныеСотрудника.Вставить("КодДолжности", ДанныеДолжностиЭТД.КодДолжности);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеДолжностиЭТД.НаименованиеДолжности) Тогда
			ДанныеСотрудника.Вставить("НаименованиеДолжности", ДанныеДолжностиЭТД.НаименованиеДолжности);
		КонецЕсли;
		
		Если ДанныеПрофильНавыков.ОбщиеНавыки.Количество() > 0 Тогда
			ДанныеСотрудника.Вставить("ОбщиеНавыки", ДанныеПрофильНавыков.ОбщиеНавыки.Выгрузить());
		КонецЕсли;
		
		Если ДанныеПрофильНавыков.ПрофессиональныеНавыки.Количество() > 0 Тогда
			ДанныеСотрудника.Вставить("СпециальныеНавыки", ДанныеПрофильНавыков.ПрофессиональныеНавыки.Выгрузить());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеУчетаСотрудника.ВидЗанятости) Тогда
			ДанныеСотрудника.Вставить("ПоСовместительству", ?(ДанныеУчетаСотрудника.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство 
													ИЛИ ДанныеУчетаСотрудника.ВидЗанятости = Перечисления.ВидыЗанятости.ВнутреннееСовместительство, Истина, Ложь));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеУчетаСотрудника.СрочныйДоговор) И ЗначениеЗаполнено(ДанныеУчетаСотрудника.ДатаОкончания) Тогда
			ДанныеСотрудника.Вставить("ДатаОкончания", ДанныеУчетаСотрудника.ДатаОкончания);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеУчетаСотрудника.ТрудовойДоговорНомер) Тогда
			ДанныеСотрудника.Вставить("НомерДоговора", ДанныеУчетаСотрудника.ТрудовойДоговорНомер);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеУчетаСотрудника.ДоляНеполногоРабочегоВремени) Тогда
			Если ДанныеУчетаСотрудника.ДоляНеполногоРабочегоВремени = 1 Тогда
				ДанныеСотрудника.Вставить("РежимРабочегоВремени", "1");	
			ИначеЕсли ДанныеУчетаСотрудника.ДоляНеполногоРабочегоВремени < 1 Тогда
				ДанныеСотрудника.Вставить("РежимРабочегоВремени", "3");
			КонецЕсли;
			ДанныеСотрудника.Вставить("ДоляНеполногоРабочегоВремени", ДанныеУчетаСотрудника.ДоляНеполногоРабочегоВремени);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеУчетаСотрудника.ИНН) Тогда
			ДанныеСотрудника.Вставить("ИИНРаботника", ДанныеУчетаСотрудника.ИНН)
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеУчетаСотрудника.ВидСобытия) 
			И (ДанныеУчетаСотрудника.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Прием
			ИЛИ ДанныеУчетаСотрудника.ВидСобытия = Перечисления.ВидыКадровыхСобытий.НачальныеДанные) Тогда
			Если ЗначениеЗаполнено(ДанныеУчетаСотрудника.ТрудовойДоговорДата) Тогда
				ДанныеСотрудника.Вставить("ДатаЗаключения", ДанныеУчетаСотрудника.ТрудовойДоговорДата);
			Иначе
				ДанныеСотрудника.Вставить("ДатаЗаключения", ДанныеУчетаСотрудника.ДатаПриема);
			КонецЕсли;
			ДанныеСотрудника.Вставить("ДатаНачала", ДанныеУчетаСотрудника.ДатаПриема)
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьЗапросОсновныеДоговорыЗУП(Запрос)
	
	ДатаКадровыхДанных = ТекущаяДатаСеанса();
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация = Запрос.Параметры.Организация;
	ПараметрыПолучения.ОтбиратьПоГоловнойОрганизации = Ложь;
	ПараметрыПолучения.РаботникиПоДоговорамГПХ = Ложь;
	ПараметрыПолучения.НачалоПериода = ДатаКадровыхДанных;
	ПараметрыПолучения.ОкончаниеПериода = ДатаКадровыхДанных;
	ПараметрыПолучения.КадровыеДанные = "ДатаПриема";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ПараметрыПолучения);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Сотрудник КАК Сотрудник,
	|	ДанныеДокументов.ДатаПриема КАК Период
	|ПОМЕСТИТЬ ВТСотрудникиИПериод
	|ИЗ
	|	ВТСотрудникиОрганизации КАК ДанныеДокументов";
	Запрос.Выполнить();
	
	ОписательВТ = 
		КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц,
			"ВТСотрудникиИПериод");
			
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
		ОписательВТ, Истина, "РабочееМестоРегистратор,ТрудовойДоговорНомер,ТрудовойДоговорДата,ДатаПриема,ДатаОкончания,СрочныйДоговор,СезонныйДоговор,ВидЗанятости,ДоляНеполногоРабочегоВремени,Должность,ДолжностьПоШтатномуРасписанию");
		
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	СотрудникиОрганизации.Должность КАК Должность,
		|	СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	МАКСИМУМ(СопоставлениеДолжностейЭТД.Период) КАК СопоставлениеДолжностейЭТДПериод
		|ПОМЕСТИТЬ ВТ_СопоставлениеДолжностейПериод
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК СотрудникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеДолжностейЭТД КАК СопоставлениеДолжностейЭТД
		|		ПО СотрудникиОрганизации.Должность = СопоставлениеДолжностейЭТД.ДолжностьОрганизации
		|			И СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию = СопоставлениеДолжностейЭТД.ДолжностьПоШтатномуРасписанию
		|			И СотрудникиОрганизации.Период >= СопоставлениеДолжностейЭТД.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиОрганизации.Сотрудник,
		|	СотрудникиОрганизации.Должность,
		|	СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	СотрудникиОрганизации.Должность КАК Должность,
		|	СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	СотрудникиОрганизации.РабочееМестоРегистратор КАК ДокументОснование,
		|	ЕСТЬNULL(ЭТД.Ссылка, ЗНАЧЕНИЕ(Документ.ЭТД.ПустаяСсылка)) КАК ЭТДСсылка,
		|	ЕСТЬNULL(ЭТД.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЭТД.ПустаяСсылка)) КАК Статус,
		|	ЕСТЬNULL(ЭТД.НомерДоговора, СотрудникиОрганизации.ТрудовойДоговорНомер) КАК НомерДоговора,
		|	ЕСТЬNULL(ЭТД.ДатаЗаключения, СотрудникиОрганизации.ТрудовойДоговорДата) КАК ДатаЗаключения,
		|	ЕСТЬNULL(ЭТД.ДатаЗаключения, СотрудникиОрганизации.ДатаПриема) КАК ДатаНачала,
		|	ЕСТЬNULL(ЭТД.МестоРаботы, """") КАК МестоРаботы,
		|	ЕСТЬNULL(ЭТД.КодРегиона, """") КАК КодРегиона,
		|	ЕСТЬNULL(ЭТД.СрокДействия, """") КАК СрокДействия,
		|	ЕСТЬNULL(ЭТД.КодДолжности, ЕСТЬNULL(СопоставлениеДолжностейЭТД.КодДолжностиЭТД, ЕСТЬNULL(СопоставлениеДолжностейЭТДАктуальное.КодДолжностиЭТД, """"))) КАК ЭТДКодДолжности,
		|	ЕСТЬNULL(ЭТД.НаименованиеДолжности, ЕСТЬNULL(СопоставлениеДолжностейЭТД.НаименованиеЭТД, ЕСТЬNULL(СопоставлениеДолжностейЭТДАктуальное.НаименованиеЭТД, """"))) КАК ЭТДДолжность,
		|	ЕСТЬNULL(ЭТД.РежимРабочегоВремени, ВЫБОР
		|			КОГДА СотрудникиОрганизации.ДоляНеполногоРабочегоВремени < 1
		|				ТОГДА ""3""
		|			ИНАЧЕ ""1""
		|		КОНЕЦ) КАК РежимРабочегоВремени,
		|	ВЫБОР
		|		КОГДА ЭТД.Статус ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Порядок,
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизации.ВидЗанятости ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СотрудникиОрганизации.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство))
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК ПоСовместительству,
		|	ЭТД.Ссылка КАК Ссылка,
		|	Сотрудники.Наименование
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК СотрудникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭТД КАК ЭТД
		|		ПО СотрудникиОрганизации.Сотрудник = ЭТД.Сотрудник
		|			И (НЕ ЭТД.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеДолжностейЭТД.СрезПоследних(&Период, Организация = &Организация) КАК СопоставлениеДолжностейЭТДАктуальное
		|		ПО СотрудникиОрганизации.Должность = СопоставлениеДолжностейЭТДАктуальное.ДолжностьОрганизации
		|			И СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию = СопоставлениеДолжностейЭТДАктуальное.ДолжностьПоШтатномуРасписанию
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СопоставлениеДолжностейПериод КАК СопоставлениеДолжностейПериод
		|		ПО СотрудникиОрганизации.Сотрудник = СопоставлениеДолжностейПериод.Сотрудник
		|			И СотрудникиОрганизации.Должность = СопоставлениеДолжностейПериод.Должность
		|			И СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию = СопоставлениеДолжностейПериод.ДолжностьПоШтатномуРасписанию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеДолжностейЭТД КАК СопоставлениеДолжностейЭТД
		|		ПО (СопоставлениеДолжностейПериод.Должность = СопоставлениеДолжностейЭТД.ДолжностьОрганизации)
		|			И (СопоставлениеДолжностейПериод.ДолжностьПоШтатномуРасписанию = СопоставлениеДолжностейЭТД.ДолжностьПоШтатномуРасписанию)
		|			И (СопоставлениеДолжностейПериод.СопоставлениеДолжностейЭТДПериод = СопоставлениеДолжностейЭТД.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО СотрудникиОрганизации.Сотрудник = Сотрудники.Ссылка
		|ГДЕ
		|	(ЭТД.Ссылка ЕСТЬ NULL
		|			ИЛИ НЕ ЭТД.ЭтоДополнительноеСоглашение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудники.Наименование";
	
КонецПроцедуры

Процедура СформироватьЗапросДопСоглашенияЗУП(Запрос)
	
	ДатаКадровыхДанных = ТекущаяДатаСеанса();
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация = Запрос.Параметры.Организация;
	ПараметрыПолучения.ОтбиратьПоГоловнойОрганизации = Ложь;
	ПараметрыПолучения.РаботникиПоДоговорамГПХ = Ложь;
	ПараметрыПолучения.НачалоПериода = ДатаКадровыхДанных;
	ПараметрыПолучения.ОкончаниеПериода = ДатаКадровыхДанных;
	ПараметрыПолучения.КадровыеДанные = "ДатаПриема";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ПараметрыПолучения);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Сотрудник КАК Сотрудник,
	|	ДанныеДокументов.ДатаПриема КАК Период,
	|	&Период КАК ПериодПо
	|ПОМЕСТИТЬ ВТСотрудникиИПериод
	|ИЗ
	|	ВТСотрудникиОрганизации КАК ДанныеДокументов";
	Запрос.Выполнить();
	
	ОписательВТ = 
		КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц,
			"ВТСотрудникиИПериод");
			
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
		ОписательВТ, Истина, "РабочееМестоРегистратор,ТрудовойДоговорНомер,ТрудовойДоговорДата,ДатаПриема,ДатаОкончания,СрочныйДоговор,СезонныйДоговор,ВидЗанятости,ДоляНеполногоРабочегоВремени,Должность,ДолжностьПоШтатномуРасписанию");
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		"ВТСотрудникиИПериод", 
		"Сотрудник");
	
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаНачала", "Период");
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаОкончания", "ПериодПо");
	
	ЗарплатаКадрыПериодическиеРегистры.СоздатьВТИмяРегистраПериоды(
		"КадроваяИсторияСотрудников",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ОписаниеФильтра,
		,
		"ВТИнтервалыКадроваяИсторияСотрудников");
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадроваяИсторияСотрудниковЗаписи.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудниковЗаписи.Должность КАК Должность,
		|	КадроваяИсторияСотрудниковЗаписи.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	КадроваяИсторияСотрудниковЗаписи.Регистратор КАК ДокументОснование,
		|	КадроваяИсторияСотрудниковЗаписи.Период КАК ДатаИзменения,
		|	МАКСИМУМ(СопоставлениеДолжностейЭТД.Период) КАК СопоставлениеДолжностейЭТДПериод
		|ПОМЕСТИТЬ ВТ_ИзмененныеДолжности
		|ИЗ
		|	ВТИнтервалыКадроваяИсторияСотрудников КАК КадроваяИсторияСотрудниковЗаписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнтервалыКадроваяИсторияСотрудников КАК КадроваяИсторияСотрудниковПредыдущиеЗаписи
		|		ПО КадроваяИсторияСотрудниковЗаписи.Сотрудник = КадроваяИсторияСотрудниковПредыдущиеЗаписи.Сотрудник
		|			И (КадроваяИсторияСотрудниковЗаписи.НачалоПериода = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудниковПредыдущиеЗаписи.КонецПериода, ДЕНЬ), ДЕНЬ, 1))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеДолжностейЭТД КАК СопоставлениеДолжностейЭТД
		|		ПО КадроваяИсторияСотрудниковЗаписи.Должность = СопоставлениеДолжностейЭТД.ДолжностьОрганизации
		|			И КадроваяИсторияСотрудниковЗаписи.ДолжностьПоШтатномуРасписанию = СопоставлениеДолжностейЭТД.ДолжностьПоШтатномуРасписанию
		|			И КадроваяИсторияСотрудниковЗаписи.Период >= СопоставлениеДолжностейЭТД.Период
		|ГДЕ
		|	НЕ КадроваяИсторияСотрудниковПредыдущиеЗаписи.Период ЕСТЬ NULL
		|	И КадроваяИсторияСотрудниковЗаписи.Должность <> КадроваяИсторияСотрудниковПредыдущиеЗаписи.Должность
		|
		|СГРУППИРОВАТЬ ПО
		|	КадроваяИсторияСотрудниковЗаписи.Сотрудник,
		|	КадроваяИсторияСотрудниковЗаписи.Должность,
		|	КадроваяИсторияСотрудниковЗаписи.ДолжностьПоШтатномуРасписанию,
		|	КадроваяИсторияСотрудниковЗаписи.Регистратор,
		|	КадроваяИсторияСотрудниковЗаписи.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_ИзмененныеДолжности.Сотрудник КАК Сотрудник,
		|	ВТ_ИзмененныеДолжности.Должность КАК Должность,
		|	ВТ_ИзмененныеДолжности.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	ВТ_ИзмененныеДолжности.ДокументОснование КАК ДокументОснование,
		|	ЕСТЬNULL(ЭТДДопСоглашение.Ссылка, ЗНАЧЕНИЕ(Документ.ЭТД.ПустаяСсылка)) КАК ДопСоглашениеСсылка,
		|	ЕСТЬNULL(ЭТДОсновной.Ссылка, ЗНАЧЕНИЕ(Документ.ЭТД.ПустаяСсылка)) КАК ОсновнойДоговорСсылка,
		|	ВЫБОР
		|		КОГДА ЭТДДопСоглашение.Ссылка ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(ЭТДОсновной.МестоРаботы, """")
		|		ИНАЧЕ ЭТДДопСоглашение.МестоРаботы
		|	КОНЕЦ КАК МестоРаботы,
		|	ВЫБОР
		|		КОГДА ЭТДДопСоглашение.Ссылка ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(ЭТДОсновной.КодРегиона, """")
		|		ИНАЧЕ ЭТДДопСоглашение.КодРегиона
		|	КОНЕЦ КАК КодРегиона,
		|	ВЫБОР
		|		КОГДА ЭТДДопСоглашение.Ссылка ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(ЭТДОсновной.СрокДействия, """")
		|		ИНАЧЕ ЭТДДопСоглашение.СрокДействия
		|	КОНЕЦ КАК СрокДействия,
		|	ЕСТЬNULL(ЭТДДопСоглашение.НомерДоговора, ЕСТЬNULL(ЭТДОсновной.НомерДоговора + ""/"", """")) КАК НомерДоговора,
		|	ЕСТЬNULL(ЭТДДопСоглашение.ДатаЗаключения, ВТ_ИзмененныеДолжности.ДатаИзменения) КАК ДатаНачала,
		|	ЕСТЬNULL(ЭТДДопСоглашение.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЭТД.ПустаяСсылка)) КАК ДопСоглашениеСтатус,
		|	ЕСТЬNULL(ЭТДОсновной.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЭТД.ПустаяСсылка)) КАК ОсновнойДоговорСтатус,
		|	ВЫБОР
		|		КОГДА ЭТДДопСоглашение.Ссылка ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Порядок,
		|	ЕСТЬNULL(ЭТДДопСоглашение.КодДолжности, ЕСТЬNULL(СопоставлениеДолжностейЭТД.КодДолжностиЭТД, ЕСТЬNULL(СопоставлениеДолжностейЭТДАктуальное.КодДолжностиЭТД, """"))) КАК ЭТДКодДолжности,
		|	ЕСТЬNULL(ЭТДДопСоглашение.НаименованиеДолжности, ЕСТЬNULL(СопоставлениеДолжностейЭТД.НаименованиеЭТД, ЕСТЬNULL(СопоставлениеДолжностейЭТДАктуальное.НаименованиеЭТД, """"))) КАК ЭТДДолжность,
		|	ЕСТЬNULL(ЭТДОсновной.КодТяжелыхУсловийТруда, """") КАК КодТяжелыхУсловийТруда,
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	ВТ_ИзмененныеДолжности КАК ВТ_ИзмененныеДолжности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭТД КАК ЭТДДопСоглашение
		|		ПО ВТ_ИзмененныеДолжности.Сотрудник = ЭТДДопСоглашение.Сотрудник
		|			И (НАЧАЛОПЕРИОДА(ВТ_ИзмененныеДолжности.ДатаИзменения, ДЕНЬ) = ЭТДДопСоглашение.ДатаЗаключения)
		|			И (ЭТДДопСоглашение.ЭтоДополнительноеСоглашение)
		|			И (НЕ ЭТДДопСоглашение.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеДолжностейЭТД.СрезПоследних(&Период, Организация = &Организация) КАК СопоставлениеДолжностейЭТДАктуальное
		|		ПО ВТ_ИзмененныеДолжности.Должность = СопоставлениеДолжностейЭТДАктуальное.ДолжностьОрганизации
		|			И ВТ_ИзмененныеДолжности.ДолжностьПоШтатномуРасписанию = СопоставлениеДолжностейЭТДАктуальное.ДолжностьПоШтатномуРасписанию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеДолжностейЭТД КАК СопоставлениеДолжностейЭТД
		|		ПО ВТ_ИзмененныеДолжности.Должность = СопоставлениеДолжностейЭТД.ДолжностьОрганизации
		|			И ВТ_ИзмененныеДолжности.ДолжностьПоШтатномуРасписанию = СопоставлениеДолжностейЭТД.ДолжностьПоШтатномуРасписанию
		|			И ВТ_ИзмененныеДолжности.СопоставлениеДолжностейЭТДПериод = СопоставлениеДолжностейЭТД.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК СотрудникиОрганизации
		|		ПО ВТ_ИзмененныеДолжности.Сотрудник = СотрудникиОрганизации.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭТД КАК ЭТДОсновной
		|		ПО (СотрудникиОрганизации.РабочееМестоРегистратор = ЭТДОсновной.ДокументОснование)
		|			И (НЕ ЭТДОсновной.ЭтоДополнительноеСоглашение)
		|			И (НЕ ЭТДОсновной.ПометкаУдаления)
		|			И (СотрудникиОрганизации.Сотрудник = ЭТДОсновной.Сотрудник)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ВТ_ИзмененныеДолжности.Сотрудник = Сотрудники.Ссылка
		|ГДЕ
		|	НЕ ЭТДОсновной.Ссылка ЕСТЬ NULL
		|	И ЭТДОсновной.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭТД.Зарегистрирован)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
КонецПроцедуры

Процедура СформироватьЗапросСопоставлениеДолжностейЗУП(Запрос)
	
	Если ИспользоватьШтатноеРасписание() Тогда
		
		ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание(Запрос.Параметры.ПериодАктуальности, Запрос.Параметры.Организация);
		
		УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПостроения, , "ВТДанныеШтатногоРасписания");
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ДанныеШтатногоРасписания.Должность КАК Должность,
			|	ДанныеШтатногоРасписания.ПозицияШтатногоРасписания КАК ДолжностьПоШтатномуРасписанию
			|ПОМЕСТИТЬ ВТ_Должности
			|ИЗ
			|	ВТДанныеШтатногоРасписания КАК ДанныеШтатногоРасписания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МИНИМУМ(ЕСТЬNULL(СопоставлениеДолжностейЭТД.Период, ЕСТЬNULL(КадроваяИсторияСотрудниковСрезПервых.Период, ДАТАВРЕМЯ(1900, 1, 1)))) КАК Период,
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.Организация, &Организация) КАК Организация,
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.ДолжностьОрганизации, ВТ_Должности.Должность) КАК ДолжностьОрганизации,
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.ДолжностьПоШтатномуРасписанию, ВТ_Должности.ДолжностьПоШтатномуРасписанию) КАК ДолжностьПоШтатномуРасписанию,
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.КодДолжностиЭТД, """") КАК КодДолжностиЭТД,
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.НаименованиеЭТД, """") КАК НаименованиеЭТД
			|ИЗ
			|	ВТ_Должности КАК ВТ_Должности
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеДолжностейЭТД.СрезПоследних(&ПериодАктуальности, Организация = &Организация) КАК СопоставлениеДолжностейЭТД
			|		ПО СопоставлениеДолжностейЭТД.ДолжностьПоШтатномуРасписанию = ВТ_Должности.ДолжностьПоШтатномуРасписанию
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПервых(, ) КАК КадроваяИсторияСотрудниковСрезПервых
			|		ПО ВТ_Должности.ДолжностьПоШтатномуРасписанию = КадроваяИсторияСотрудниковСрезПервых.ДолжностьПоШтатномуРасписанию
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.Организация, &Организация),
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.ДолжностьОрганизации, ВТ_Должности.Должность),
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.ДолжностьПоШтатномуРасписанию, ВТ_Должности.ДолжностьПоШтатномуРасписанию),
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.КодДолжностиЭТД, """"),
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.НаименованиеЭТД, """")";
		
	Иначе
		
		ДатаКадровыхДанных = ТекущаяДатаСеанса();
		ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолучения.Организация = Запрос.Параметры.Организация;
		ПараметрыПолучения.ОтбиратьПоГоловнойОрганизации = Ложь;
		ПараметрыПолучения.РаботникиПоДоговорамГПХ = Ложь;
		ПараметрыПолучения.НачалоПериода = ДатаКадровыхДанных;
		ПараметрыПолучения.ОкончаниеПериода = ДатаКадровыхДанных;
		
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(
			Запрос.МенеджерВременныхТаблиц,
			Истина,
			ПараметрыПолучения);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеДокументов.Сотрудник КАК Сотрудник,
		|	&ПериодАктуальности КАК Период
		|ПОМЕСТИТЬ ВТСотрудникиИПериод
		|ИЗ
		|	ВТСотрудникиОрганизации КАК ДанныеДокументов";
		Запрос.Выполнить();
		
		ОписательВТ = 
			КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
				Запрос.МенеджерВременныхТаблиц,
				"ВТСотрудникиИПериод");
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
			ОписательВТ, Истина, "Должность, ДолжностьПоШтатномуРасписанию");
			
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	КадроваяИсторияСотрудников.Должность КАК Должность,
			|	КадроваяИсторияСотрудников.Организация КАК Организация
			|ПОМЕСТИТЬ ВТ_Должности
			|ИЗ
			|	ВТКадровыеДанныеСотрудников КАК КадроваяИсторияСотрудников
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МИНИМУМ(ЕСТЬNULL(СопоставлениеДолжностейЭТД.Период, ЕСТЬNULL(КадроваяИсторияСотрудниковСрезПервых.Период, ДАТАВРЕМЯ(1900, 1, 1)))) КАК Период,
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.Организация, &Организация) КАК Организация,
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.ДолжностьОрганизации, ВТ_Должности.Должность) КАК ДолжностьОрганизации,
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.ДолжностьПоШтатномуРасписанию, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК ДолжностьПоШтатномуРасписанию,
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.КодДолжностиЭТД, """") КАК КодДолжностиЭТД,
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.НаименованиеЭТД, """") КАК НаименованиеЭТД
			|ИЗ
			|	ВТ_Должности КАК ВТ_Должности
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеДолжностейЭТД.СрезПоследних(&ПериодАктуальности, Организация = &Организация) КАК СопоставлениеДолжностейЭТД
			|		ПО СопоставлениеДолжностейЭТД.ДолжностьОрганизации = ВТ_Должности.Должность
			|			И СопоставлениеДолжностейЭТД.Организация = ВТ_Должности.Организация
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПервых() КАК КадроваяИсторияСотрудниковСрезПервых
			|		ПО ВТ_Должности.Должность = КадроваяИсторияСотрудниковСрезПервых.Должность
			|		И ВТ_Должности.Организация = КадроваяИсторияСотрудниковСрезПервых.Организация
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.Организация, &Организация),
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.ДолжностьОрганизации, ВТ_Должности.Должность),
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.ДолжностьПоШтатномуРасписанию, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)),
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.КодДолжностиЭТД, """"),
			|	ЕСТЬNULL(СопоставлениеДолжностейЭТД.НаименованиеЭТД, """")";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьЗапросДоговорыУволенныхЗУП(Запрос)
	
	ДатаКадровыхДанных = ТекущаяДатаСеанса();
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация = Запрос.Параметры.Организация;
	ПараметрыПолучения.ОтбиратьПоГоловнойОрганизации = Ложь;
	ПараметрыПолучения.РаботникиПоДоговорамГПХ = Ложь;
	ПараметрыПолучения.НачалоПериода = ДатаКадровыхДанных;
	ПараметрыПолучения.ОкончаниеПериода = ДатаКадровыхДанных;
	ПараметрыПолучения.КадровыеДанные = "ДатаПриема,ДатаУвольнения";
	ПараметрыПолучения.ВключаяУволенныхНаНачалоПериода = Истина;
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ПараметрыПолучения,
		"ВТСотрудникиОрганизации");
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Сотрудник КАК Сотрудник,
	|	ДанныеДокументов.ДатаПриема КАК Период
	|ПОМЕСТИТЬ ВТСотрудникиИПериод
	|ИЗ
	|	ВТСотрудникиОрганизации КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.Выполнить();
	
	ОписательВТ = 
		КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц,
			"ВТСотрудникиИПериод");
	
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
		ОписательВТ, Истина, "ТрудовойДоговорНомер,ДатаПриема,ДатаУвольнения,ПриказОбУвольненииСтатьяТКРФ");
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	СотрудникиОрганизации.ДатаУвольнения КАК ДатаРасторжения,
		|	СотрудникиОрганизации.ПриказОбУвольненииСтатьяТКРФ КАК ПричинаРасторжения,
		|	ЕСТЬNULL(ЭТД.НомерДоговора, СотрудникиОрганизации.ТрудовойДоговорНомер) КАК НомерДоговора,
		|	ЕСТЬNULL(ЭТД.ДатаЗаключения, СотрудникиОрганизации.ДатаПриема) КАК ДатаНачала,
		|	ЕСТЬNULL(ЭТД.Ссылка, ЗНАЧЕНИЕ(Документ.ЭТД.ПустаяСсылка)) КАК ЭТДСсылка,
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК СотрудникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭТД КАК ЭТД
		|		ПО СотрудникиОрганизации.Сотрудник = ЭТД.Сотрудник
		|			И (НЕ ЭТД.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО СотрудникиОрганизации.Сотрудник = Сотрудники.Ссылка
		|ГДЕ
		|	НЕ ЭТД.Ссылка ЕСТЬ NULL
		|	И ЭТД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭТД.Зарегистрирован)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудники.Наименование";
	
КонецПроцедуры

Процедура СформироватьЗапросВосстановленныеДоговорыЗУП(Запрос)
	
	ДатаКадровыхДанных = ТекущаяДатаСеанса();
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация = Запрос.Параметры.Организация;
	ПараметрыПолучения.ОтбиратьПоГоловнойОрганизации = Ложь;
	ПараметрыПолучения.РаботникиПоДоговорамГПХ = Ложь;
	ПараметрыПолучения.НачалоПериода = ДатаКадровыхДанных;
	ПараметрыПолучения.ОкончаниеПериода = ДатаКадровыхДанных;
	ПараметрыПолучения.КадровыеДанные = "ДатаПриема,ДатаУвольнения";
	ПараметрыПолучения.ВключаяУволенныхНаНачалоПериода = Истина;
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ПараметрыПолучения,
		"ВТСотрудникиОрганизации");
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Сотрудник КАК Сотрудник,
	|	ДанныеДокументов.ДатаПриема КАК Период
	|ПОМЕСТИТЬ ВТСотрудникиИПериод
	|ИЗ
	|	ВТСотрудникиОрганизации КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.Выполнить();
	
	ОписательВТ = 
		КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц,
			"ВТСотрудникиИПериод");
	
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
		ОписательВТ, Истина, "ТрудовойДоговорНомер,ДатаПриема,ДатаУвольнения,ПриказОбУвольненииСтатьяТКРФ");
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ЭТД.ДатаРасторжения, СотрудникиОрганизации.ДатаУвольнения) КАК ДатаРасторжения,
		|	ЕСТЬNULL(ЭТД.ОснованиеУвольнения, СотрудникиОрганизации.ПриказОбУвольненииСтатьяТКРФ) КАК ПричинаРасторжения,
		|	ЕСТЬNULL(ЭТД.НомерДоговора, СотрудникиОрганизации.ТрудовойДоговорНомер) КАК НомерДоговора,
		|	ЕСТЬNULL(ЭТД.ДатаЗаключения, СотрудникиОрганизации.ДатаПриема) КАК ДатаНачала,
		|	ЕСТЬNULL(ЭТД.Ссылка, ЗНАЧЕНИЕ(Документ.ЭТД.ПустаяСсылка)) КАК ЭТДСсылка,
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК СотрудникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭТД КАК ЭТД
		|		ПО СотрудникиОрганизации.Сотрудник = ЭТД.Сотрудник
		|			И (НЕ ЭТД.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО СотрудникиОрганизации.Сотрудник = Сотрудники.Ссылка
		|ГДЕ
		|	НЕ ЭТД.Ссылка ЕСТЬ NULL
		|	И ЭТД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭТД.Расторгнут)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудники.Наименование";
	
КонецПроцедуры

Функция БИНОрганизацииЗУП(Организация)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН");
	
	Возврат Результат;
	
КонецФункции

Функция ИИНРаботникаЗУП(ФизическоеЛицо)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "ИНН");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСотрудникаПоИИНЗУП(ИИН, Организация, ДатаЗаключения)
	
	Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация = Организация;
	ПараметрыПолучения.ОтбиратьПоГоловнойОрганизации = Ложь;
	ПараметрыПолучения.РаботникиПоДоговорамГПХ = Ложь;
	ПараметрыПолучения.НачалоПериода = ДатаЗаключения;
	ПараметрыПолучения.ОкончаниеПериода = ДатаЗаключения;
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ПараметрыПолучения);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЕСТЬNULL(СотрудникиОрганизации.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК СотрудникиОрганизации
		|		ПО ФизическиеЛица.Ссылка = СотрудникиОрганизации.ФизическоеЛицо
		|ГДЕ
		|	ФизическиеЛица.ИНН = &ИИН
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник УБЫВ";
	
	Запрос.УстановитьПараметр("ИИН", ИИН);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
	КонецЦикла;
	
	Возврат Сотрудник;
	
КонецФункции

Функция ПолучитьИИНПоСотрудникуЗУП(Сотрудник)
	
	ИИН = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ФизическиеЛица.ИНН, """") КАК ИИН
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО Сотрудники.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИИН = ВыборкаДетальныеЗаписи.ИИН;
	КонецЦикла;
	
	Возврат ИИН;
	
КонецФункции

Процедура ПолучитьДанныеДляАвтозаполненияЗУП(Организация, Период, СтруктураДанныхДляАвтозаполнения)
	
	СписокПоказателей = Новый Массив;
	СписокПоказателей.Добавить("ОКАТО");
	СписокПоказателей.Добавить("ПолныйАдрЮР");
	СписокПоказателей.Добавить("ЭтоЮридическоеЛицо");
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		СведенияОбОрганизации = Новый Структура("ПолныйАдрЮР,ОКАТО,ЭтоЮридическоеЛицо", "", "", "");
	Иначе
		СведенияОбОрганизации = ЗарплатаКадрыБазовый.ПолучитьСведенияОбОрганизации(Организация, Период, СписокПоказателей);
	КонецЕсли;
	
	МестоРаботы = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, Период);
	Если НЕ ЗначениеЗаполнено(МестоРаботы) Тогда
		МестоРаботы = СведенияОбОрганизации.ПолныйАдрЮР;
	КонецЕсли;
	КодРегиона = "";
	Если СведенияОбОрганизации.ОКАТО <> ",,,,,,,,," Тогда
		КодРегиона = Лев(СведенияОбОрганизации.ОКАТО, 9);
	КонецЕсли;
	
	ТипРаботодателя = "";
	Если СведенияОбОрганизации.ЭтоЮридическоеЛицо = Истина Тогда
		ТипРаботодателя = "1";
	ИначеЕсли СведенияОбОрганизации.ЭтоЮридическоеЛицо = Ложь Тогда
		ТипРаботодателя = "2";
	КонецЕсли;
	
	СтруктураДанныхДляАвтозаполнения.МестоРаботы = МестоРаботы;
	СтруктураДанныхДляАвтозаполнения.КодРегиона = КодРегиона;
	СтруктураДанныхДляАвтозаполнения.КодРегионаРабочегоМеста = КодРегиона;
	СтруктураДанныхДляАвтозаполнения.ТипРаботодателя = ТипРаботодателя;
	
КонецПроцедуры

Процедура ЗаполнитьНаборыЗначенийДоступаЗУП(ДокументОбъект, Таблица)
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИСотрудникам(ДокументОбъект, Таблица, "Организация", "Сотрудник");
	
КонецПроцедуры

Функция ИдентификаторЭТДЗУП(Документ)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Идентификатор");
	
	Возврат Результат;
	
КонецФункции

Функция СотрудникПодходитДляПрофессиональнойВыплатыЗУП(Сотрудник, ПериодДанных)
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Сотрудник, "Возраст,СведенияОПенсионномОбеспеченииПенсионерПоВозрасту", ПериодДанных);
	Если КадровыеДанные <> Неопределено И КадровыеДанные.Возраст <> NULL И КадровыеДанные.Возраст >= 55
		И КадровыеДанные.СведенияОПенсионномОбеспеченииПенсионерПоВозрасту <> Истина Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьПризнакГражданстваРКЗУП(Сотрудник, ПериодДанных)
	
	Страна = "";
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Сотрудник, "Страна", ПериодДанных);
	Если КадровыеДанные <> Неопределено Тогда
		Страна = КадровыеДанные.Страна;
	КонецЕсли;
	
	Если Страна = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СтраныМира.Казахстан") Тогда
		Возврат Истина;
	ИначеЕсли ТипЗнч(Страна) = Тип("СправочникСсылка.СтраныМира") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПараметрыСотрудникаДляСоциальногоОтпускаЗУП(Сотрудник, Знач ДатаПолученияДанных)
	
	Если ДатаПолученияДанных = Неопределено Тогда
		ДатаПолученияДанных = ТекущаяДатаСеанса();
	КонецЕсли;
	
	КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Сотрудник, "ФИО,Подразделение", ДатаПолученияДанных);
	ПараметрыСотрудника = Новый Структура("ФИОРаботника,ПодразделениеНаРусскомЯзыке,ПодразделениеНаКазахскомЯзыке",
											КадровыеДанныеСотрудника.ФИО,
											ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыеДанныеСотрудника.Подразделение, "Наименование"),
											"");
	
	Возврат ПараметрыСотрудника;
	
КонецФункции

Функция ПолучитьКоличествоВыходныхДнейЗаПериодЗУП(Сотрудник, НачалоПериода, КонецПериода)
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Сотрудник, "ГрафикРаботы", НачалоПериода);
	ВидУчетаВремени = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ВыходныеДни");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("График", КадровыеДанные.ГрафикРаботы);
	Запрос.УстановитьПараметр("ВидУчетаВремени", ВидУчетаВремени);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецПериода);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ДанныеГрафикаРаботы.Дата) КАК Дней
		|ИЗ
		|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ДанныеГрафикаРаботы
		|ГДЕ
		|	ДанныеГрафикаРаботы.ГрафикРаботы = &График
		|	И ДанныеГрафикаРаботы.ВидУчетаВремени = &ВидУчетаВремени
		|	И ДанныеГрафикаРаботы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.ВыгрузитьКолонку("Дней")[0];
	
КонецФункции

#КонецОбласти
